results/2018-05-05_17-05-42/post-4k/aleph-server.out
Running 180m test @ http://127.0.0.1:3000/
  3 threads and 500 connections
  Thread calibration: mean lat.: 1.038ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.023ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.035ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.02ms  425.27us  52.42ms   67.97%
    Req/Sec   173.23    100.27   800.00     71.96%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.03ms
 75.000%    1.31ms
 90.000%    1.53ms
 99.000%    2.06ms
 99.900%    2.29ms
 99.990%    4.69ms
 99.999%   11.60ms
100.000%   52.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.178     0.000000            1         1.00
       0.453     0.100000       541889         1.11
       0.629     0.200000      1080295         1.25
       0.779     0.300000      1621957         1.43
       0.913     0.400000      2160411         1.67
       1.032     0.500000      2700021         2.00
       1.088     0.550000      2971616         2.22
       1.142     0.600000      3237927         2.50
       1.198     0.650000      3511066         2.86
       1.254     0.700000      3778256         3.33
       1.312     0.750000      4046454         4.00
       1.342     0.775000      4181837         4.44
       1.373     0.800000      4319797         5.00
       1.403     0.825000      4452826         5.71
       1.435     0.850000      4588551         6.67
       1.474     0.875000      4722718         8.00
       1.500     0.887500      4789460         8.89
       1.532     0.900000      4855307        10.00
       1.572     0.912500      4922717        11.43
       1.619     0.925000      4990036        13.33
       1.674     0.937500      5057936        16.00
       1.705     0.943750      5091558        17.78
       1.739     0.950000      5125743        20.00
       1.775     0.956250      5158636        22.86
       1.816     0.962500      5192488        26.67
       1.862     0.968750      5226612        32.00
       1.885     0.971875      5242871        35.56
       1.910     0.975000      5259889        40.00
       1.936     0.978125      5276844        45.71
       1.963     0.981250      5293634        53.33
       1.993     0.984375      5310789        64.00
       2.009     0.985938      5319109        71.11
       2.026     0.987500      5327492        80.00
       2.044     0.989062      5335604        91.43
       2.065     0.990625      5344555       106.67
       2.085     0.992188      5352435       128.00
       2.099     0.992969      5357227       142.22
       2.111     0.993750      5361005       160.00
       2.125     0.994531      5365158       182.86
       2.141     0.995313      5369417       213.33
       2.159     0.996094      5373523       256.00
       2.171     0.996484      5375977       284.44
       2.181     0.996875      5377809       320.00
       2.195     0.997266      5380062       365.71
       2.209     0.997656      5382131       426.67
       2.225     0.998047      5384145       512.00
       2.235     0.998242      5385250       568.89
       2.245     0.998437      5386242       640.00
       2.257     0.998633      5387333       731.43
       2.269     0.998828      5388251       853.33
       2.287     0.999023      5389355      1024.00
       2.297     0.999121      5389847      1137.78
       2.309     0.999219      5390348      1280.00
       2.325     0.999316      5390899      1462.86
       2.345     0.999414      5391444      1706.67
       2.371     0.999512      5391945      2048.00
       2.391     0.999561      5392198      2275.56
       2.417     0.999609      5392453      2560.00
       2.459     0.999658      5392726      2925.71
       2.531     0.999707      5392982      3413.33
       3.715     0.999756      5393241      4096.00
       3.991     0.999780      5393374      4551.11
       4.143     0.999805      5393508      5120.00
       4.295     0.999829      5393637      5851.43
       4.435     0.999854      5393770      6826.67
       4.575     0.999878      5393903      8192.00
       4.627     0.999890      5393968      9102.22
       4.699     0.999902      5394036     10240.00
       4.779     0.999915      5394098     11702.86
       4.871     0.999927      5394163     13653.33
       4.999     0.999939      5394231     16384.00
       5.047     0.999945      5394262     18204.44
       5.111     0.999951      5394295     20480.00
       5.187     0.999957      5394328     23405.71
       5.275     0.999963      5394361     27306.67
       5.399     0.999969      5394394     32768.00
       5.511     0.999973      5394410     36408.89
       5.639     0.999976      5394427     40960.00
       6.047     0.999979      5394443     46811.43
       7.143     0.999982      5394460     54613.33
       8.039     0.999985      5394476     65536.00
       9.295     0.999986      5394484     72817.78
       9.903     0.999988      5394493     81920.00
      11.111     0.999989      5394501     93622.86
      12.623     0.999991      5394509    109226.67
      13.639     0.999992      5394517    131072.00
      14.399     0.999993      5394521    145635.56
      14.671     0.999994      5394526    163840.00
      15.007     0.999995      5394530    187245.71
      15.143     0.999995      5394534    218453.33
      15.415     0.999996      5394538    262144.00
      15.471     0.999997      5394541    291271.11
      15.479     0.999997      5394542    327680.00
      15.799     0.999997      5394544    374491.43
      16.239     0.999998      5394546    436906.67
      17.503     0.999998      5394548    524288.00
      17.679     0.999998      5394549    582542.22
      17.711     0.999998      5394550    655360.00
      17.807     0.999999      5394551    748982.86
      18.895     0.999999      5394552    873813.33
      22.207     0.999999      5394553   1048576.00
      26.863     0.999999      5394554   1165084.44
      26.863     0.999999      5394554   1310720.00
      29.151     0.999999      5394555   1497965.71
      29.151     0.999999      5394555   1747626.67
      41.951     1.000000      5394556   2097152.00
      41.951     1.000000      5394556   2330168.89
      41.951     1.000000      5394556   2621440.00
      52.255     1.000000      5394557   2995931.43
      52.255     1.000000      5394557   3495253.33
      52.255     1.000000      5394557   4194304.00
      52.255     1.000000      5394557   4660337.78
      52.255     1.000000      5394557   5242880.00
      52.447     1.000000      5394558   5991862.86
      52.447     1.000000      5394558          inf
#[Mean    =        1.024, StdDeviation   =        0.425]
#[Max     =       52.416, Total count    =      5394558]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5400039 requests in 180.00m, 679.78MB read
Requests/sec:    500.00
Transfer/sec:     64.45KB