results/2018-05-05_17-05-42/post-4k/httpkit-server.out
Running 180m test @ http://127.0.0.1:3000/
  3 threads and 500 connections
  Thread calibration: mean lat.: 0.974ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.968ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.972ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.97ms  426.74us   7.55ms   65.76%
    Req/Sec   172.06     87.72   555.00     75.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02ms
 75.000%    1.29ms
 90.000%    1.46ms
 99.000%    1.98ms
 99.900%    2.22ms
 99.990%    4.00ms
 99.999%    4.90ms
100.000%    7.55ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.144     0.000000            1         1.00
       0.359     0.100000       541565         1.11
       0.537     0.200000      1081286         1.25
       0.717     0.300000      1621166         1.43
       0.876     0.400000      2161308         1.67
       1.019     0.500000      2697975         2.00
       1.080     0.550000      2971417         2.22
       1.134     0.600000      3238340         2.50
       1.186     0.650000      3510279         2.86
       1.236     0.700000      3777160         3.33
       1.287     0.750000      4050965         4.00
       1.311     0.775000      4181973         4.44
       1.336     0.800000      4318121         5.00
       1.362     0.825000      4455331         5.71
       1.388     0.850000      4589197         6.67
       1.416     0.875000      4722144         8.00
       1.434     0.887500      4789070         8.89
       1.456     0.900000      4855285        10.00
       1.485     0.912500      4923561        11.43
       1.525     0.925000      4991425        13.33
       1.575     0.937500      5057567        16.00
       1.606     0.943750      5091980        17.78
       1.639     0.950000      5125161        20.00
       1.675     0.956250      5159365        22.86
       1.712     0.962500      5192570        26.67
       1.753     0.968750      5226591        32.00
       1.776     0.971875      5243440        35.56
       1.801     0.975000      5260153        40.00
       1.829     0.978125      5276998        45.71
       1.860     0.981250      5293607        53.33
       1.896     0.984375      5310564        64.00
       1.916     0.985938      5318829        71.11
       1.938     0.987500      5327258        80.00
       1.962     0.989062      5335627        91.43
       1.989     0.990625      5344296       106.67
       2.017     0.992188      5352656       128.00
       2.033     0.992969      5356876       142.22
       2.049     0.993750      5361143       160.00
       2.065     0.994531      5365184       182.86
       2.085     0.995313      5369651       213.33
       2.105     0.996094      5373669       256.00
       2.117     0.996484      5375793       284.44
       2.129     0.996875      5377820       320.00
       2.143     0.997266      5380102       365.71
       2.155     0.997656      5381922       426.67
       2.171     0.998047      5384093       512.00
       2.179     0.998242      5385105       568.89
       2.189     0.998437      5386267       640.00
       2.199     0.998633      5387319       731.43
       2.209     0.998828      5388305       853.33
       2.223     0.999023      5389421      1024.00
       2.231     0.999121      5389929      1137.78
       2.239     0.999219      5390418      1280.00
       2.249     0.999316      5390953      1462.86
       2.259     0.999414      5391445      1706.67
       2.273     0.999512      5391967      2048.00
       2.281     0.999561      5392198      2275.56
       2.293     0.999609      5392496      2560.00
       2.305     0.999658      5392739      2925.71
       2.323     0.999707      5393001      3413.33
       2.349     0.999756      5393250      4096.00
       2.377     0.999780      5393382      4551.11
       2.447     0.999805      5393506      5120.00
       3.327     0.999829      5393638      5851.43
       3.605     0.999854      5393769      6826.67
       3.823     0.999878      5393901      8192.00
       3.925     0.999890      5393968      9102.22
       4.017     0.999902      5394033     10240.00
       4.107     0.999915      5394101     11702.86
       4.187     0.999927      5394164     13653.33
       4.283     0.999939      5394230     16384.00
       4.331     0.999945      5394263     18204.44
       4.379     0.999951      5394298     20480.00
       4.431     0.999957      5394330     23405.71
       4.479     0.999963      5394363     27306.67
       4.543     0.999969      5394399     32768.00
       4.591     0.999973      5394411     36408.89
       4.631     0.999976      5394428     40960.00
       4.667     0.999979      5394445     46811.43
       4.727     0.999982      5394462     54613.33
       4.775     0.999985      5394477     65536.00
       4.799     0.999986      5394485     72817.78
       4.835     0.999988      5394494     81920.00
       4.883     0.999989      5394502     93622.86
       4.915     0.999991      5394512    109226.67
       4.947     0.999992      5394518    131072.00
       4.979     0.999993      5394522    145635.56
       5.027     0.999994      5394528    163840.00
       5.063     0.999995      5394531    187245.71
       5.099     0.999995      5394535    218453.33
       5.187     0.999996      5394539    262144.00
       5.195     0.999997      5394541    291271.11
       5.259     0.999997      5394543    327680.00
       5.283     0.999997      5394545    374491.43
       5.311     0.999998      5394547    436906.67
       5.367     0.999998      5394549    524288.00
       5.475     0.999998      5394550    582542.22
       5.495     0.999998      5394551    655360.00
       5.943     0.999999      5394552    748982.86
       6.387     0.999999      5394553    873813.33
       6.391     0.999999      5394554   1048576.00
       6.699     0.999999      5394555   1165084.44
       6.699     0.999999      5394555   1310720.00
       6.927     0.999999      5394556   1497965.71
       6.927     0.999999      5394556   1747626.67
       7.119     1.000000      5394557   2097152.00
       7.119     1.000000      5394557   2330168.89
       7.119     1.000000      5394557   2621440.00
       7.159     1.000000      5394558   2995931.43
       7.159     1.000000      5394558   3495253.33
       7.159     1.000000      5394558   4194304.00
       7.159     1.000000      5394558   4660337.78
       7.159     1.000000      5394558   5242880.00
       7.555     1.000000      5394559   5991862.86
       7.555     1.000000      5394559          inf
#[Mean    =        0.973, StdDeviation   =        0.427]
#[Max     =        7.552, Total count    =      5394559]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5400040 requests in 180.00m, 540.74MB read
Requests/sec:    500.00
Transfer/sec:     51.27KB